If I may add an example of modification when the SKIP rule is added on the top of other rule:
```
Terraform will perform the following actions:

  # cloudflare_ruleset.test will be updated in-place
  ~ resource "cloudflare_ruleset" "test" {
        id          = "ab58416d926e438891d4a9432a53ce3c"
        name        = "Managed Rules"
        # (4 unchanged attributes hidden)

      ~ rules {
          ~ action       = "execute" -> "skip"
          ~ description  = "OWASP" -> "Account skip"
          ~ expression   = "true" -> "(http.request.uri.query contains \"skip=true\")"
          ~ id           = "e3081599c38444c6896c35f1db9f958e" -> (known after apply)
          ~ last_updated = "2023-07-07 08:21:48.599209 +0000 UTC" -> (known after apply)
          ~ ref          = "owasp" -> "skip"
          ~ version      = "1" -> (known after apply)
            # (1 unchanged attribute hidden)

          ~ action_parameters {
              - id      = "4814384a9e5d4991b9815dcfc25d2f1f" -> null
              + ruleset = "current"
              ~ version = "latest" -> (known after apply)

              - matched_data {
                  - public_key = "xxx=" -> null
                }

              - overrides {
                  - rules {
                      - action          = "block" -> null
                      - id              = "6179ae15870a4bb7b2d480d4843b323c" -> null
                      - score_threshold = 25 -> null
                    }
                }
            }
        }
      ~ rules {
          ~ description  = "Account Cf Managed Rules vence.fun" -> "OWASP"
          ~ expression   = "(cf.zone.name eq \"vence.fun\")" -> "true"
          ~ id           = "2e968543c4c940249491f771c2d663fa" -> (known after apply)
          ~ last_updated = "2023-07-07 08:21:48.599209 +0000 UTC" -> (known after apply)
          ~ ref          = "cloudflaremr" -> "owasp"
          ~ version      = "1" -> (known after apply)
            # (2 unchanged attributes hidden)

          ~ action_parameters {
              ~ id      = "efb7b8c949ac4650a09736fc376e9aee" -> "4814384a9e5d4991b9815dcfc25d2f1f"
              ~ version = "latest" -> (known after apply)

              + overrides {
                  + rules {
                      + action          = "block"
                      + id              = "6179ae15870a4bb7b2d480d4843b323c"
                      + score_threshold = 25
                    }
                }

                # (1 unchanged block hidden)
            }
        }
      + rules {
          + action       = "execute"
          + description  = "Account Cf Managed Rules vence.fun"
          + enabled      = true
          + expression   = "(cf.zone.name eq \"vence.fun\")"
          + id           = (known after apply)
          + last_updated = (known after apply)
          + ref          = "cloudflaremr"
          + version      = (known after apply)

          + action_parameters {
              + id      = "efb7b8c949ac4650a09736fc376e9aee"
              + version = (known after apply)

              + matched_data {
                  + public_key = "xxx="
                }
            }
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```